<script setup>
const contractInfo = [
	{
		id: '1',
		title: '1. Определение терминов',
		subtitles: [
			'1.1. В настоящей Политике конфиденциальности используются следующие термины:',
			'1.1.1. «Администрация сайта» (далее – Администрация) – уполномоченные сотрудники на управление сайтом https://div-school.by и чат ботов, которые организуют и (или) осуществляют обработку персональных данных, а также определяет цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными.',
			'1.1.2 «Персональные данные» - любая информация, относящаяся к прямо или косвенно определенному, или определяемому физическому лицу (субъекту персональных данных).',
			'1.1.3. «Обработка персональных данных» - любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.',
			'1.1.4. «Конфиденциальность персональных данных» - обязательное для соблюдения Оператором или иным получившим доступ к персональным данным лицом требование не допускать их распространения без согласия субъекта персональных данных или наличия иного законного основания.',
			'1.1.5. «Сайт https://div-school.by» - это совокупность связанных между собой веб-страниц, размещенных в сети Интернет по уникальному адресу (URL): https://div-school.by, а также его субдоменах.',
			'1.1.6. «Субдомены» - это страницы или совокупность страниц, расположенные на доменах третьего уровня, принадлежащие сайту https://div-school.by, а также другие временные страницы, внизу который указана контактная информация Администрации',
			'1.1.7. Чат боты - это чат в Инстаграм alena_okotchik.',
			'1.1.8. «Пользователь сайта https://div-school.by» (далее Пользователь) или чат ботов – лицо, имеющее доступ к сайту https://div-school.by или чат ботам, посредством сети Интернет и использующее информацию, материалы и продукты сайта https://div-school.by или чат ботов.',
			'1.1.9. «Cookies» — небольшой фрагмент данных, отправленный веб-сервером и хранимый на компьютере пользователя, который веб-клиент или веб-браузер каждый раз пересылает веб-серверу в HTTP-запросе при попытке открыть страницу соответствующего сайта.',
			'1.1.10 «IP-адрес» — уникальный сетевой адрес узла в компьютерной сети, через который Пользователь получает доступ на https://div-school.by или чат боты.',
		],
	},
	{
		id: '2',
		title: '2. Общие положения',
		subtitles: [
			'2.1 Использование сайта https://div-school.by или чат ботов Пользователем означает согласие с настоящей Политикой конфиденциальности и условиями обработки персональных данных Пользователя.',
			'2.2 В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить использование сайта https://div-school.by или чат ботов.',
			'2.3 Настоящая Политика конфиденциальности применяется к сайту https://div-school.by и чат ботам. https://div-school.by и чат боты не контролирует и не несет ответственность за сайты третьих лиц, на которые Пользователь может перейти по ссылкам, доступным на сайте https://div-school.by или в чат ботах.',
			'2.4 Администрация не проверяет достоверность персональных данных, предоставляемых Пользователем.',
		],
	},
	{
		id: '3',
		title: '3. Предмет политики конфиденциальности',
		subtitles: [
			'3.1 Настоящая Политика конфиденциальности устанавливает обязательства Администрации по неразглашению и обеспечению режима защиты конфиденциальности персональных данных, которые Пользователь предоставляет по запросу Администрации при регистрации на сайте https://div-school.by, чат ботах или при подписке на информационную e-mail рассылку.',
			'3.2 Персональные данные, разрешённые к обработке в рамках настоящей Политики конфиденциальности, предоставляются Пользователем путём заполнения форм на сайте https://div-school.by или чат ботах и включают в себя следующую информацию:',
			'3.2.1 фамилию, имя, отчество Пользователя;',
			'3.2.2 контактный телефон Пользователя;',
			'3.2.3 адрес электронной почты (e-mail);',
			'3.2.4 место жительство Пользователя (при необходимости);',
			'3.2.5 фотографию (при необходимости);',
			'3.2.6 логин Инстаграмм/телеграмм (при необходимости);',
			'3.3 https://div-school.by и чат боты защищают Данные, которые автоматически передаются при посещении страниц: <br/>- IP адрес; <br/> - информация из cookies; <br/> - информация о браузере; <br/> - время доступа; <br/> - реферер (адрес предыдущей страницы).',
			'3.3.1 Отключение cookies может повлечь невозможность доступа к частям сайта , требующим авторизации.',
			'3.3.2 https://div-school.by и чат боты осуществляет сбор статистики об IP-адресах своих посетителей. Данная информация используется с целью предотвращения, выявления и решения технических проблем.',
			'3.4 Любая иная персональная информация неоговоренная выше (история посещения, используемые браузеры, операционные системы и т.д.) подлежит надежному хранению и нераспространению, за исключением случаев, предусмотренных в п.п. 5.2. настоящей Политики конфиденциальности.',
		],
	},
	{
		id: '4',
		title: '4. Цели сбора персональной информации пользователя',
		subtitles: [
			'4.1 Персональные данные Пользователя Администрация может использовать в целях:',
			'4.1.1 Идентификации Пользователя, зарегистрированного на сайте https://div-school.by или в чат ботах для его дальнейшей авторизации.',
			'4.1.2 Предоставления Пользователю доступа к персонализированным данным сайта https://div-school.by или чат ботов.',
			'4.1.3 Установления с Пользователем обратной связи, включая направление уведомлений, запросов, касающихся использования сайта https://div-school.by или чат ботов, обработки запросов и заявок от Пользователя.',
			'4.1.4 Определения места нахождения Пользователя для обеспечения безопасности, предотвращения мошенничества.',
			'4.1.5 Подтверждения достоверности и полноты персональных данных, предоставленных Пользователем.',
			'4.1.6 Создания учетной записи для использования частей сайта https://div-school.by или чат ботов, если Пользователь дал согласие на создание учетной записи.',
			'4.1.7 Уведомления Пользователя по электронной почте.',
			'4.1.8 Предоставления Пользователю эффективной технической поддержки при возникновении проблем, связанных с использованием сайта https://div-school.by или чат ботов.',
			'4.1.9 Предоставления Пользователю с его согласия специальных предложений, новостной рассылки и иных сведений от имени сайта https://div-school.by или чат ботов.',
			'4.1.10 Передача данных в Банк для оформления кредита/рассрочки, при выборе данных условий оплаты услуги клиентом.',
		],
	},
	{
		id: '5',
		title: '5. Способы и сроки обработки персональной информации',
		subtitles: [
			'5.1 Обработка персональных данных Пользователя осуществляется без ограничения срока, любым законным способом, в том числе в информационных системах персональных данных с использованием средств автоматизации или без использования таких средств.',
			'5.2 Персональные данные Пользователя могут быть переданы уполномоченным органам государственной власти Республики Беларусь только по основаниям и в порядке, установленным законодательством Республики Беларусь.',
			'5.3 При утрате или разглашении персональных данных Администрация вправе не информировать Пользователя об утрате или разглашении персональных данных.',
			'5.4 Администрация принимает необходимые организационные и технические меры для защиты персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий третьих лиц.',
			'5.5 Администрация совместно с Пользователем принимает все необходимые меры по предотвращению убытков или иных отрицательных последствий, вызванных утратой или разглашением персональных данных Пользователя.',
		],
	},
	{
		id: '6',
		title: '6. Права и обязанности сторон',
		subtitles: [
			'6.1 Пользователь вправе:',
			'6.1.1 Принимать свободное решение о предоставлении своих персональных данных, необходимых для использования сайта https://div-school.by или чат ботов, и давать согласие на их обработку.',
			'6.1.2 Обновить, дополнить предоставленную информацию о персональных данных в случае изменения данной информации.',
			'6.1.3 Пользователь имеет право на получение у Администрации информации, касающейся обработки его персональных данных. Для этого достаточно уведомить Администрацию по указаному E-mail адресу.',
			'6.2 Администрация обязана:',
			'6.2.1 Использовать полученную информацию исключительно для целей, указанных в п. 4 настоящей Политики конфиденциальности.',
			'6.2.2 Обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного письменного разрешения Пользователя, а также не осуществлять продажу, обмен, опубликование, либо разглашение иными возможными способами переданных персональных данных Пользователя, за исключением п.п. 5.2. настоящей Политики Конфиденциальности.',
			'6.2.3 Принимать меры предосторожности для защиты конфиденциальности персональных данных Пользователя согласно порядку, обычно используемого для защиты такого рода информации в существующем деловом обороте.',
			'6.2.4 Осуществить блокирование персональных данных, относящихся к соответствующему Пользователю, с момента обращения или запроса Пользователя, или его законного представителя либо уполномоченного органа по защите прав субъектов персональных данных на период проверки, в случае выявления недостоверных персональных данных или неправомерных действий.',
		],
	},
	{
		id: '7',
		title: '7. Ответственность сторон',
		subtitles: [
			'7.1 Администрация, не исполнившая свои обязательства, несёт ответственность за убытки, понесённые Пользователем в связи с неправомерным использованием персональных данных, в соответствии с законодательством Республики Беларусь, за исключением случаев, предусмотренных п.п. 5.2. и 7.2. настоящей Политики Конфиденциальности.',
			'7.2 В случае утраты или разглашения Конфиденциальной информации Администрация не несёт ответственность, если данная конфиденциальная информация:',
			'7.2.1 Стала публичным достоянием до её утраты или разглашения.',
			'7.2.2 Была получена от третьей стороны до момента её получения Администрацией Ресурса.',
			'7.2.3 Была разглашена с согласия Пользователя.',
			'7.3 Пользователь несет полную ответственность за соблюдение требований законодательства Республики Беларусь, в том числе законов о рекламе, о защите авторских и смежных прав, об охране товарных знаков и знаков обслуживания, но не ограничиваясь перечисленным, включая полную ответственность за содержание и форму материалов.',
			'7.4 Пользователь признает, что ответственность за любую информацию (в том числе, но не ограничиваясь: файлы с данными, тексты и т. д.), к которой он может иметь доступ как к части сайта https://div-school.by или чат ботов, несет лицо, предоставившее такую информацию.',
			'7.5 Пользователь соглашается, что информация, предоставленная ему как часть сайта https://div-school.by или чат ботов, может являться объектом интеллектуальной собственности, права на который защищены и принадлежат другим Пользователям, партнерам или рекламодателям, которые размещают такую информацию на сайте https://div-school.by или в чат ботах. Пользователь не вправе вносить изменения, передавать в аренду, передавать на условиях займа, продавать, распространять или создавать производные работы на основе такого Содержания (полностью или в части), за исключением случаев, когда такие действия были письменно прямо разрешены собственниками такого Содержания в соответствии с условиями отдельного соглашения.',
			'7.6 В отношение текстовых материалов (статей, публикаций, находящихся в свободном публичном доступе на сайте https://div-school.by или чат ботах) допускается их распространение при условии, что будет дана ссылка на https://div-school.by или чат боты.',
			'7.7 Администрация не несет ответственности перед Пользователем за любой убыток или ущерб, понесенный Пользователем в результате удаления, сбоя или невозможности сохранения какого-либо Содержания и иных коммуникационных данных, содержащихся на сайте https://div-school.by или в чат ботах, или передаваемых через него.',
			'7.8 Администрация не несет ответственности за любые прямые или косвенные убытки, произошедшие из-за: использования либо невозможности использования сайта или чат ботов, либо отдельных сервисов; несанкционированного доступа к коммуникациям Пользователя; заявления или поведение любого третьего лица на сайте или в чат ботах.',
			'7.9 Администрация не несет ответственность за какую-либо информацию, размещенную пользователем на сайте https://div-school.by или в чат ботах, включая, но не ограничиваясь: информацию, защищенную авторским правом, без прямого согласия владельца авторского права.',
		],
	},
	{
		id: '8',
		title: '8. Разрешение споров',
		subtitles: [
			'8.1 До обращения в суд с иском по спорам, возникающим из отношений между Пользователем и Администрацией, обязательным является предъявление претензии (письменного предложения или предложения в электронном виде о добровольном урегулировании спора).',
			'8.2 Получатель претензии в течение 30 календарных дней со дня получения претензии, письменно или в электронном виде уведомляет заявителя претензии о результатах рассмотрения претензии.',
			'8.3 При не достижении соглашения спор будет передан на рассмотрение суда г. Петриков.',
			'8.4 К настоящей Политике конфиденциальности и отношениям между Пользователем и Администрацией применяется действующее законодательство Республики Беларусь.',
		],
	},
	{
		id: '9',
		title: '9. Дополнительные условия',
		subtitles: [
			'9.1 Администрация вправе вносить изменения в настоящую Политику конфиденциальности без согласия Пользователя.',
			'9.2 Новая Политика конфиденциальности вступает в силу с момента ее размещения на сайте https://div-school.by, если иное не предусмотрено новой редакцией Политики конфиденциальности.',
			'9.3 Все предложения или вопросы касательно настоящей Политики конфиденциальности следует сообщать по адресу: ip.okotchik@bk.ru',
			'9.4 Действующая Политика конфиденциальности размещена на странице по адресу http://https://div-school.by/privacyPolicy',
			'Обновлено: 20 мая 2024 года',
			'г. Новогрудок, ИП ОКОТЧИК Е.К., УНП 591625019 выдано',
			'14.10.2022  Новогрудским районным исполнительным',
			'комитетом',
		],
	},
]
</script>

<template>
	<div className="public-contract">
		<div className="block-container">
			<div className="public-contract__box">
				<a href="/" className="public-contract__back"> Назад </a>
				<h1 className="public-contract__title">
					Политика конфиденциальности персональных данных
				</h1>
				<p className="public-contract__text">
					Настоящая Политика конфиденциальности персональных данных (далее –
					Политика конфиденциальности) действует в отношении всей информации,
					которую сайт https://div-school.by, (далее – https://div-school.by)
					расположенный на доменном имени https://div-school.by (а также его
					субдоменах) и чат ботах в Инстаграмм alena_okotchik, может получить о
					Пользователе во время использования сайта https://div-school.by (а
					также его субдоменов), чат ботов, его программ и его продуктов.
				</p>
				<div className="public-contract__list">
					<div
						className="public-contract__list_item"
						v-for="(item, i) in contractInfo"
						:key="i">
						<h3 className="public-contract__item_title">
							{{ item.title }}
						</h3>
						<p
							v-for="(subtitle, i) in item.subtitles"
							:key="i"
							className="public-contract__item_text"
							v-html="subtitle"></p>
					</div>
				</div>
			</div>
		</div>
	</div>
</template>

<style lang="scss">
@import '/src/assets/services/main.scss';
a {
	color: $accent_1;
	text-decoration: underline;
	font-family: $inter;
	font-weight: 500;
}
span {
	color: red;
	font-family: $inter;
	font-weight: 500;
}
.public-contract {
	width: 100%;
	padding: 75px;
	@media (max-width: $media-s) {
		padding: 20px;
	}
	&__box {
		width: 100%;
		display: flex;
		flex-direction: column;
		align-items: flex-start;
		gap: 20px;
		.public-contract__back {
			background-color: $accent_1;
			padding: 10px 30px;
			border-radius: 10px;
			color: $white;
			text-decoration: none;
		}
		.public-contract__title {
			width: 100%;
			text-align: center;
			font-family: $inter;
			font-weight: 300;
			font-size: 24px;
		}
		.public-contract__info {
			display: flex;
			flex-direction: column;
			align-items: flex-start;
			gap: 10px;
		}
		.public-contract__text {
			font-family: $inter;
			font-weight: 300;
			font-size: 20px;
			text-align: justify;
			line-height: 35px;
		}
		.public-contract__list {
			width: 100%;
			display: flex;
			flex-direction: column;
			align-items: flex-start;
			gap: 60px;
			&_item {
				width: 100%;
				display: flex;
				flex-direction: column;
				align-items: flex-start;
				gap: 10px;
				.public-contract__item_title {
					font-family: $inter;
					font-weight: 300;
					font-size: 24px;
				}
				.public-contract__item_text {
					font-weight: 300;
					font-family: $inter;
					font-size: 20px;
					text-align: justify;
					line-height: 35px;
				}
			}
		}
	}
}
</style>
